7767517
1474 1806
SherpaMetaData           sherpa_meta_data1        0 0 0=2 1=32 2=4 3=7 -23316=5,2,2,2,2,2 -23317=5,256,256,256,256,256 -23318=5,192,192,192,192,192 -23319=5,1,2,4,8,2 -23320=5,31,31,31,31,31 15=1
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Split                    splitncnn_1              1 2 in2 5 6
Input                    in3                      0 1 in3
Split                    splitncnn_2              1 2 in3 8 9
Input                    in4                      0 1 in4
Split                    splitncnn_3              1 2 in4 11 12
Input                    in5                      0 1 in5
Split                    splitncnn_4              1 2 in5 14 15
Input                    in6                      0 1 in6
Split                    splitncnn_5              1 2 in6 17 18
Input                    in7                      0 1 in7
Split                    splitncnn_6              1 2 in7 20 21
Input                    in8                      0 1 in8
Split                    splitncnn_7              1 2 in8 23 24
Input                    in9                      0 1 in9
Split                    splitncnn_8              1 2 in9 26 27
Input                    in10                     0 1 in10
Split                    splitncnn_9              1 2 in10 29 30
Input                    in11                     0 1 in11
Split                    splitncnn_10             1 2 in11 32 33
Input                    in12                     0 1 in12
Split                    splitncnn_11             1 2 in12 35 36
Input                    in13                     0 1 in13
Split                    splitncnn_12             1 2 in13 38 39
Input                    in14                     0 1 in14
Split                    splitncnn_13             1 2 in14 41 42
Input                    in15                     0 1 in15
Split                    splitncnn_14             1 2 in15 44 45
Input                    in16                     0 1 in16
Split                    splitncnn_15             1 2 in16 47 48
Input                    in17                     0 1 in17
Split                    splitncnn_16             1 2 in17 50 51
Input                    in18                     0 1 in18
Split                    splitncnn_17             1 2 in18 53 54
Input                    in19                     0 1 in19
Split                    splitncnn_18             1 2 in19 56 57
Input                    in20                     0 1 in20
Split                    splitncnn_19             1 2 in20 59 60
Input                    in21                     0 1 in21
Split                    splitncnn_20             1 2 in21 62 63
Input                    in22                     0 1 in22
Split                    splitncnn_21             1 2 in22 65 66
Input                    in23                     0 1 in23
Split                    splitncnn_22             1 2 in23 68 69
Input                    in24                     0 1 in24
Split                    splitncnn_23             1 2 in24 71 72
Input                    in25                     0 1 in25
Split                    splitncnn_24             1 2 in25 74 75
Input                    in26                     0 1 in26
Split                    splitncnn_25             1 2 in26 77 78
Input                    in27                     0 1 in27
Split                    splitncnn_26             1 2 in27 80 81
Input                    in28                     0 1 in28
Split                    splitncnn_27             1 2 in28 83 84
Input                    in29                     0 1 in29
Split                    splitncnn_28             1 2 in29 86 87
Input                    in30                     0 1 in30
Split                    splitncnn_29             1 2 in30 89 90
Input                    in31                     0 1 in31
Split                    splitncnn_30             1 2 in31 92 93
Input                    in32                     0 1 in32
Split                    splitncnn_31             1 2 in32 95 96
Input                    in33                     0 1 in33
Split                    splitncnn_32             1 2 in33 98 99
Input                    in34                     0 1 in34
Split                    splitncnn_33             1 2 in34 101 102
Input                    in35                     0 1 in35
Split                    splitncnn_34             1 2 in35 104 105
MemoryData               encoders.4.encoder.layers.1 0 1 106 0=1
MemoryData               encoders.4.encoder.layers.0 0 1 107 0=1
MemoryData               encoders.4.encoder.encoder_pos 0 1 108 0=256 1=47
MemoryData               encoders.4.encoder.encoder_pos_1 0 1 109 0=256 1=47
MemoryData               encoders.3.encoder.layers.1 0 1 110 0=1
MemoryData               encoders.3.encoder.layers.0 0 1 111 0=1
MemoryData               encoders.3.encoder.encoder_pos 0 1 112 0=256 1=11
MemoryData               encoders.3.encoder.encoder_pos_1 0 1 113 0=256 1=11
MemoryData               encoders.2.encoder.layers.1 0 1 114 0=1
MemoryData               encoders.2.encoder.layers.0 0 1 115 0=1
MemoryData               encoders.2.encoder.encoder_pos 0 1 116 0=256 1=23
MemoryData               encoders.2.encoder.encoder_pos_1 0 1 117 0=256 1=23
MemoryData               encoders.1.encoder.layers.1 0 1 118 0=1
MemoryData               encoders.1.encoder.layers.0 0 1 119 0=1
MemoryData               encoders.1.encoder.encoder_pos 0 1 120 0=256 1=47
MemoryData               encoders.1.encoder.encoder_pos_1 0 1 121 0=256 1=47
MemoryData               encoders.0.layers.1      0 1 122 0=1
MemoryData               encoders.0.layers.0      0 1 123 0=1
MemoryData               encoders.0.encoder_pos   0 1 124 0=256 1=95
MemoryData               encoders.0.encoder_pos_1 0 1 125 0=256 1=95
ExpandDims               unsqueeze_501            1 1 in0 126 -23303=1,0
Convolution              conv_128                 1 1 126 127 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_35             1 2 127 128 129
BinaryOp                 sub_0                    1 1 128 130 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_20               1 1 130 131
BinaryOp                 mul_1                    2 1 129 131 132 0=2
Convolution              conv_129                 1 1 132 133 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_36             1 2 133 134 135
BinaryOp                 sub_2                    1 1 134 136 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_21               1 1 136 137
BinaryOp                 mul_3                    2 1 135 137 138 0=2
Convolution              conv_130                 1 1 138 139 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_37             1 2 139 140 141
BinaryOp                 sub_4                    1 1 140 142 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_22               1 1 142 143
BinaryOp                 mul_5                    2 1 141 143 144 0=2
Crop                     crop_502                 1 1 3 145 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.0.state_select_list.0_ncnnreshape0 1 1 145 146 0=0 1=0
Crop                     crop_503                 1 1 18 147 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_10_ncnnreshape0 1 1 147 148 0=0 1=0
Crop                     crop_504                 1 1 33 149 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_11_ncnnreshape0 1 1 149 150 0=0 1=0
Crop                     crop_505                 1 1 48 151 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_12_ncnnreshape0 1 1 151 152 0=0 1=0
Crop                     crop_506                 1 1 63 153 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_13_ncnnreshape0 1 1 153 154 0=0 1=0
Crop                     crop_507                 1 1 78 155 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_14_ncnnreshape0 1 1 155 156 0=0 1=0
Crop                     crop_508                 1 1 93 157 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_15_ncnnreshape0 1 1 157 158 0=0 1=0
Permute                  permute_448              1 1 144 159 0=2
Reshape                  reshape_252              1 1 159 160 0=2432 1=-1
InnerProduct             linear_131               1 1 160 161 0=256 1=1 2=622592
Split                    splitncnn_38             1 4 161 162 163 164 165
InnerProduct             linear_132               1 1 165 166 0=768 1=1 2=196608
Split                    splitncnn_39             1 2 166 167 168
BinaryOp                 sub_6                    1 1 167 169 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_23               1 1 169 170
BinaryOp                 mul_7                    2 1 168 170 171 0=2
InnerProduct             linear_133               1 1 171 172 0=256 1=1 2=196608
BinaryOp                 add_8                    2 1 162 172 173 0=0
Split                    splitncnn_40             1 2 173 174 175
PoolingModuleNoProj      pooling_modul_no_proj_652 3 3 175 146 148 176 177 178
InnerProduct             linear_134               1 1 176 179 0=256 1=0 2=65536
BinaryOp                 add_9                    2 1 174 179 180 0=0
Split                    splitncnn_41             1 2 180 181 182
InnerProduct             linear_135               1 1 182 183 0=496 1=1 2=126976
Slice                    tensor_split_0           1 4 183 184 185 186 187 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 152 186 188 0=0
Split                    splitncnn_42             1 2 188 189 190
Reshape                  reshape_253              1 1 189 191 0=24 1=4 2=80
Reshape                  reshape_254              1 1 184 192 0=48 1=4 2=16
Reshape                  reshape_255              1 1 187 193 0=4 1=4 2=16
Concat                   cat_1                    2 1 150 185 194 0=0
Split                    splitncnn_43             1 2 194 195 196
Reshape                  reshape_256              1 1 195 197 0=48 1=4 2=80
InnerProduct             linear_136               1 1 124 198 0=16 1=0 2=4096
Reshape                  reshape_257              1 1 198 199 0=4 1=4 2=95
Permute                  permute_576              1 1 199 200 0=3
Permute                  permute_574              1 1 193 201 0=2
MatMul                   matmul_418               2 1 201 200 202
Permute                  permute_575              1 1 197 203 0=3
Permute                  permute_573              1 1 192 204 0=2
MatMul                   matmul_419               2 1 204 203 205
TensorAsStrided          tensor_as_strided_662    1 1 202 206 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_10                   2 1 205 206 207 0=0
Reshape                  view_388                 1 1 207 208 0=80 1=16 2=4
Softmax                  softmax_73               1 1 208 209 0=-1 1=1
Split                    splitncnn_44             1 2 209 210 211
Permute                  permute_572              1 1 191 212 0=2
MatMul                   bmm_398                  2 1 211 212 213
Permute                  permute_577              1 1 213 214 0=2
Reshape                  reshape_258              1 1 214 215 0=96 1=16
InnerProduct             linear_137               1 1 215 216 0=256 1=1 2=24576
BinaryOp                 add_11                   2 1 181 216 217 0=0
Split                    splitncnn_45             1 2 217 218 219
Permute                  permute_450              1 1 219 220 0=1
Convolution1D            conv1d_88                1 1 220 221 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_0                    1 1 221 222 0=0
Concat                   cat_2                    2 1 156 222 223 0=1
Split                    splitncnn_46             1 2 223 224 225
ConvolutionDepthWise1D   convdw1d_681             1 1 225 226 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_47             1 2 226 227 228
BinaryOp                 sub_12                   1 1 227 229 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_24               1 1 229 230
BinaryOp                 mul_13                   2 1 228 230 231 0=2
Convolution1D            conv1d_89                1 1 231 232 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_451              1 1 232 233 0=1
BinaryOp                 add_14                   2 1 218 233 234 0=0
Split                    splitncnn_48             1 2 234 235 236
InnerProduct             linear_138               1 1 236 237 0=768 1=1 2=196608
Split                    splitncnn_49             1 2 237 238 239
BinaryOp                 sub_15                   1 1 238 240 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_25               1 1 240 241
BinaryOp                 mul_16                   2 1 239 241 242 0=2
InnerProduct             linear_139               1 1 242 243 0=256 1=1 2=196608
BinaryOp                 add_17                   2 1 235 243 244 0=0
Split                    splitncnn_50             1 2 244 245 246
InnerProduct             linear_140               1 1 246 247 0=96 1=0 2=24576
Concat                   cat_3                    2 1 154 247 248 0=0
Split                    splitncnn_51             1 2 248 249 250
Reshape                  reshape_259              1 1 249 251 0=24 1=4 2=80
Permute                  permute_578              1 1 251 252 0=2
MatMul                   bmm_399                  2 1 210 252 253
Permute                  permute_579              1 1 253 254 0=2
Reshape                  reshape_260              1 1 254 255 0=96 1=16
InnerProduct             linear_141               1 1 255 256 0=256 1=1 2=24576
BinaryOp                 add_18                   2 1 245 256 257 0=0
Split                    splitncnn_52             1 2 257 258 259
Permute                  permute_452              1 1 259 260 0=1
Convolution1D            conv1d_90                1 1 260 261 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_1                    1 1 261 262 0=0
Concat                   cat_4                    2 1 158 262 263 0=1
Split                    splitncnn_53             1 2 263 264 265
ConvolutionDepthWise1D   convdw1d_682             1 1 265 266 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_54             1 2 266 267 268
BinaryOp                 sub_19                   1 1 267 269 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_26               1 1 269 270
BinaryOp                 mul_20                   2 1 268 270 271 0=2
Convolution1D            conv1d_91                1 1 271 272 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_453              1 1 272 273 0=1
BinaryOp                 add_21                   2 1 258 273 274 0=0
Split                    splitncnn_55             1 2 274 275 276
InnerProduct             linear_142               1 1 276 277 0=768 1=1 2=196608
Split                    splitncnn_56             1 2 277 278 279
BinaryOp                 sub_22                   1 1 278 280 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_27               1 1 280 281
BinaryOp                 mul_23                   2 1 279 281 282 0=2
InnerProduct             linear_143               1 1 282 283 0=256 1=1 2=196608
BinaryOp                 add_24                   2 1 275 283 284 0=0
Split                    splitncnn_57             1 3 284 285 286 287
BinaryOp                 mul_25                   2 1 285 286 288 0=2
Reduction                mean_438                 1 1 288 289 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_26                   1 1 289 290 0=0 1=1 2=6.432362e+00
BinaryOp                 pow_27                   1 1 290 291 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_28                   2 1 287 291 292 0=2
BinaryOp                 sub_29                   2 1 292 163 293 0=1
BinaryOp                 mul_30                   2 1 293 123 294 0=2
BinaryOp                 add_31                   2 1 164 294 295 0=0
Split                    splitncnn_58             1 4 295 296 297 298 299
Crop                     crop_509                 1 1 2 300 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.0.state_select_list.1_ncnnreshape0 1 1 300 301 0=0 1=0
Crop                     crop_510                 1 1 17 302 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_22_ncnnreshape0 1 1 302 303 0=0 1=0
Crop                     crop_511                 1 1 32 304 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_23_ncnnreshape0 1 1 304 305 0=0 1=0
Crop                     crop_512                 1 1 47 306 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_24_ncnnreshape0 1 1 306 307 0=0 1=0
Crop                     crop_513                 1 1 62 308 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_25_ncnnreshape0 1 1 308 309 0=0 1=0
Crop                     crop_514                 1 1 77 310 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_26_ncnnreshape0 1 1 310 311 0=0 1=0
Crop                     crop_515                 1 1 92 312 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_27_ncnnreshape0 1 1 312 313 0=0 1=0
InnerProduct             linear_144               1 1 299 314 0=768 1=1 2=196608
Split                    splitncnn_59             1 2 314 315 316
BinaryOp                 sub_32                   1 1 315 317 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_28               1 1 317 318
BinaryOp                 mul_33                   2 1 316 318 319 0=2
InnerProduct             linear_145               1 1 319 320 0=256 1=1 2=196608
BinaryOp                 add_34                   2 1 296 320 321 0=0
Split                    splitncnn_60             1 2 321 322 323
PoolingModuleNoProj      pooling_modul_no_proj_653 3 3 323 301 303 324 325 326
InnerProduct             linear_146               1 1 324 327 0=256 1=0 2=65536
BinaryOp                 add_35                   2 1 322 327 328 0=0
Split                    splitncnn_61             1 2 328 329 330
InnerProduct             linear_147               1 1 330 331 0=496 1=1 2=126976
Slice                    tensor_split_1           1 4 331 332 333 334 335 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 307 334 336 0=0
Split                    splitncnn_62             1 2 336 337 338
Reshape                  reshape_261              1 1 337 339 0=24 1=4 2=80
Reshape                  reshape_262              1 1 332 340 0=48 1=4 2=16
Reshape                  reshape_263              1 1 335 341 0=4 1=4 2=16
Concat                   cat_6                    2 1 305 333 342 0=0
Split                    splitncnn_63             1 2 342 343 344
Reshape                  reshape_264              1 1 343 345 0=48 1=4 2=80
InnerProduct             linear_148               1 1 125 346 0=16 1=0 2=4096
Reshape                  reshape_265              1 1 346 347 0=4 1=4 2=95
Permute                  permute_584              1 1 347 348 0=3
Permute                  permute_582              1 1 341 349 0=2
MatMul                   matmul_420               2 1 349 348 350
Permute                  permute_583              1 1 345 351 0=3
Permute                  permute_581              1 1 340 352 0=2
MatMul                   matmul_421               2 1 352 351 353
TensorAsStrided          tensor_as_strided_663    1 1 350 354 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_36                   2 1 353 354 355 0=0
Reshape                  view_389                 1 1 355 356 0=80 1=16 2=4
Softmax                  softmax_74               1 1 356 357 0=-1 1=1
Split                    splitncnn_64             1 2 357 358 359
Permute                  permute_580              1 1 339 360 0=2
MatMul                   bmm_400                  2 1 359 360 361
Permute                  permute_585              1 1 361 362 0=2
Reshape                  reshape_266              1 1 362 363 0=96 1=16
InnerProduct             linear_149               1 1 363 364 0=256 1=1 2=24576
BinaryOp                 add_37                   2 1 329 364 365 0=0
Split                    splitncnn_65             1 2 365 366 367
Permute                  permute_454              1 1 367 368 0=1
Convolution1D            conv1d_92                1 1 368 369 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_2                    1 1 369 370 0=0
Concat                   cat_7                    2 1 311 370 371 0=1
Split                    splitncnn_66             1 2 371 372 373
ConvolutionDepthWise1D   convdw1d_683             1 1 373 374 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_67             1 2 374 375 376
BinaryOp                 sub_38                   1 1 375 377 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_29               1 1 377 378
BinaryOp                 mul_39                   2 1 376 378 379 0=2
Convolution1D            conv1d_93                1 1 379 380 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_455              1 1 380 381 0=1
BinaryOp                 add_40                   2 1 366 381 382 0=0
Split                    splitncnn_68             1 2 382 383 384
InnerProduct             linear_150               1 1 384 385 0=768 1=1 2=196608
Split                    splitncnn_69             1 2 385 386 387
BinaryOp                 sub_41                   1 1 386 388 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 388 389
BinaryOp                 mul_42                   2 1 387 389 390 0=2
InnerProduct             linear_151               1 1 390 391 0=256 1=1 2=196608
BinaryOp                 add_43                   2 1 383 391 392 0=0
Split                    splitncnn_70             1 2 392 393 394
InnerProduct             linear_152               1 1 394 395 0=96 1=0 2=24576
Concat                   cat_8                    2 1 309 395 396 0=0
Split                    splitncnn_71             1 2 396 397 398
Reshape                  reshape_267              1 1 397 399 0=24 1=4 2=80
Permute                  permute_586              1 1 399 400 0=2
MatMul                   bmm_401                  2 1 358 400 401
Permute                  permute_587              1 1 401 402 0=2
Reshape                  reshape_268              1 1 402 403 0=96 1=16
InnerProduct             linear_153               1 1 403 404 0=256 1=1 2=24576
BinaryOp                 add_44                   2 1 393 404 405 0=0
Split                    splitncnn_72             1 2 405 406 407
Permute                  permute_456              1 1 407 408 0=1
Convolution1D            conv1d_94                1 1 408 409 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_3                    1 1 409 410 0=0
Concat                   cat_9                    2 1 313 410 411 0=1
Split                    splitncnn_73             1 2 411 412 413
ConvolutionDepthWise1D   convdw1d_684             1 1 413 414 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_74             1 2 414 415 416
BinaryOp                 sub_45                   1 1 415 417 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 417 418
BinaryOp                 mul_46                   2 1 416 418 419 0=2
Convolution1D            conv1d_95                1 1 419 420 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_457              1 1 420 421 0=1
BinaryOp                 add_47                   2 1 406 421 422 0=0
Split                    splitncnn_75             1 2 422 423 424
InnerProduct             linear_154               1 1 424 425 0=768 1=1 2=196608
Split                    splitncnn_76             1 2 425 426 427
BinaryOp                 sub_48                   1 1 426 428 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 428 429
BinaryOp                 mul_49                   2 1 427 429 430 0=2
InnerProduct             linear_155               1 1 430 431 0=256 1=1 2=196608
BinaryOp                 add_50                   2 1 423 431 432 0=0
Split                    splitncnn_77             1 3 432 433 434 435
BinaryOp                 mul_51                   2 1 433 434 436 0=2
Reduction                mean_439                 1 1 436 437 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 437 438 0=0 1=1 2=8.898914e+00
BinaryOp                 pow_53                   1 1 438 439 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 435 439 440 0=2
BinaryOp                 sub_55                   2 1 440 297 441 0=1
BinaryOp                 mul_56                   2 1 441 122 442 0=2
BinaryOp                 add_57                   2 1 298 442 443 0=0
Split                    splitncnn_78             1 2 443 444 445
MemoryData               encoders.1.downsample    0 1 446 0=256 1=1 2=1
Reshape                  reshape_269              1 1 445 447 0=256 1=2 2=8
Split                    splitncnn_79             1 2 447 448 449
BinaryOp                 mul_58                   2 1 448 446 450 0=2
Reduction                sum_491                  1 1 450 451 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_75               1 1 451 452 0=1 1=1
BinaryOp                 mul_59                   2 1 449 452 453 0=2
Reduction                sum_492                  1 1 453 454 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_516                 1 1 6 455 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 455 456 0=0 1=0
Crop                     crop_517                 1 1 21 457 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_35_ncnnreshape0 1 1 457 458 0=0 1=0
Crop                     crop_518                 1 1 36 459 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_36_ncnnreshape0 1 1 459 460 0=0 1=0
Crop                     crop_519                 1 1 51 461 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_37_ncnnreshape0 1 1 461 462 0=0 1=0
Crop                     crop_520                 1 1 66 463 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_38_ncnnreshape0 1 1 463 464 0=0 1=0
Crop                     crop_521                 1 1 81 465 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_39_ncnnreshape0 1 1 465 466 0=0 1=0
Crop                     crop_522                 1 1 96 467 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_40_ncnnreshape0 1 1 467 468 0=0 1=0
Split                    splitncnn_80             1 4 454 469 470 471 472
InnerProduct             linear_156               1 1 472 473 0=768 1=1 2=196608
Split                    splitncnn_81             1 2 473 474 475
BinaryOp                 sub_60                   1 1 474 476 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 476 477
BinaryOp                 mul_61                   2 1 475 477 478 0=2
InnerProduct             linear_157               1 1 478 479 0=256 1=1 2=196608
BinaryOp                 add_62                   2 1 469 479 480 0=0
Split                    splitncnn_82             1 2 480 481 482
PoolingModuleNoProj      pooling_modul_no_proj_654 3 3 482 456 458 483 484 485
InnerProduct             linear_158               1 1 483 486 0=256 1=0 2=65536
BinaryOp                 add_63                   2 1 481 486 487 0=0
Split                    splitncnn_83             1 2 487 488 489
InnerProduct             linear_159               1 1 489 490 0=496 1=1 2=126976
Slice                    tensor_split_2           1 4 490 491 492 493 494 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 462 493 495 0=0
Split                    splitncnn_84             1 2 495 496 497
Reshape                  reshape_270              1 1 496 498 0=24 1=4 2=40
Reshape                  reshape_271              1 1 491 499 0=48 1=4 2=8
Reshape                  reshape_272              1 1 494 500 0=4 1=4 2=8
Concat                   cat_11                   2 1 460 492 501 0=0
Split                    splitncnn_85             1 2 501 502 503
Reshape                  reshape_273              1 1 502 504 0=48 1=4 2=40
InnerProduct             linear_160               1 1 120 505 0=16 1=0 2=4096
Reshape                  reshape_274              1 1 505 506 0=4 1=4 2=47
Permute                  permute_592              1 1 506 507 0=3
Permute                  permute_590              1 1 500 508 0=2
MatMul                   matmul_422               2 1 508 507 509
Permute                  permute_591              1 1 504 510 0=3
Permute                  permute_589              1 1 499 511 0=2
MatMul                   matmul_423               2 1 511 510 512
TensorAsStrided          tensor_as_strided_664    1 1 509 513 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_64                   2 1 512 513 514 0=0
Reshape                  view_390                 1 1 514 515 0=40 1=8 2=4
Softmax                  softmax_76               1 1 515 516 0=-1 1=1
Split                    splitncnn_86             1 2 516 517 518
Permute                  permute_588              1 1 498 519 0=2
MatMul                   bmm_402                  2 1 518 519 520
Permute                  permute_593              1 1 520 521 0=2
Reshape                  reshape_275              1 1 521 522 0=96 1=8
InnerProduct             linear_161               1 1 522 523 0=256 1=1 2=24576
BinaryOp                 add_65                   2 1 488 523 524 0=0
Split                    splitncnn_87             1 2 524 525 526
Permute                  permute_458              1 1 526 527 0=1
Convolution1D            conv1d_96                1 1 527 528 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_4                    1 1 528 529 0=0
Concat                   cat_12                   2 1 466 529 530 0=1
Split                    splitncnn_88             1 2 530 531 532
ConvolutionDepthWise1D   convdw1d_685             1 1 532 533 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_89             1 2 533 534 535
BinaryOp                 sub_66                   1 1 534 536 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 536 537
BinaryOp                 mul_67                   2 1 535 537 538 0=2
Convolution1D            conv1d_97                1 1 538 539 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_459              1 1 539 540 0=1
BinaryOp                 add_68                   2 1 525 540 541 0=0
Split                    splitncnn_90             1 2 541 542 543
InnerProduct             linear_162               1 1 543 544 0=768 1=1 2=196608
Split                    splitncnn_91             1 2 544 545 546
BinaryOp                 sub_69                   1 1 545 547 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 547 548
BinaryOp                 mul_70                   2 1 546 548 549 0=2
InnerProduct             linear_163               1 1 549 550 0=256 1=1 2=196608
BinaryOp                 add_71                   2 1 542 550 551 0=0
Split                    splitncnn_92             1 2 551 552 553
InnerProduct             linear_164               1 1 553 554 0=96 1=0 2=24576
Concat                   cat_13                   2 1 464 554 555 0=0
Split                    splitncnn_93             1 2 555 556 557
Reshape                  reshape_276              1 1 556 558 0=24 1=4 2=40
Permute                  permute_594              1 1 558 559 0=2
MatMul                   bmm_403                  2 1 517 559 560
Permute                  permute_595              1 1 560 561 0=2
Reshape                  reshape_277              1 1 561 562 0=96 1=8
InnerProduct             linear_165               1 1 562 563 0=256 1=1 2=24576
BinaryOp                 add_72                   2 1 552 563 564 0=0
Split                    splitncnn_94             1 2 564 565 566
Permute                  permute_460              1 1 566 567 0=1
Convolution1D            conv1d_98                1 1 567 568 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_5                    1 1 568 569 0=0
Concat                   cat_14                   2 1 468 569 570 0=1
Split                    splitncnn_95             1 2 570 571 572
ConvolutionDepthWise1D   convdw1d_686             1 1 572 573 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_96             1 2 573 574 575
BinaryOp                 sub_73                   1 1 574 576 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 576 577
BinaryOp                 mul_74                   2 1 575 577 578 0=2
Convolution1D            conv1d_99                1 1 578 579 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_461              1 1 579 580 0=1
BinaryOp                 add_75                   2 1 565 580 581 0=0
Split                    splitncnn_97             1 2 581 582 583
InnerProduct             linear_166               1 1 583 584 0=768 1=1 2=196608
Split                    splitncnn_98             1 2 584 585 586
BinaryOp                 sub_76                   1 1 585 587 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 587 588
BinaryOp                 mul_77                   2 1 586 588 589 0=2
InnerProduct             linear_167               1 1 589 590 0=256 1=1 2=196608
BinaryOp                 add_78                   2 1 582 590 591 0=0
Split                    splitncnn_99             1 3 591 592 593 594
BinaryOp                 mul_79                   2 1 592 593 595 0=2
Reduction                mean_440                 1 1 595 596 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_80                   1 1 596 597 0=0 1=1 2=5.620271e+00
BinaryOp                 pow_81                   1 1 597 598 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_82                   2 1 594 598 599 0=2
BinaryOp                 sub_83                   2 1 599 470 600 0=1
BinaryOp                 mul_84                   2 1 600 119 601 0=2
BinaryOp                 add_85                   2 1 471 601 602 0=0
Split                    splitncnn_100            1 4 602 603 604 605 606
Crop                     crop_523                 1 1 5 607 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 607 608 0=0 1=0
Crop                     crop_524                 1 1 20 609 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_48_ncnnreshape0 1 1 609 610 0=0 1=0
Crop                     crop_525                 1 1 35 611 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_49_ncnnreshape0 1 1 611 612 0=0 1=0
Crop                     crop_526                 1 1 50 613 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_50_ncnnreshape0 1 1 613 614 0=0 1=0
Crop                     crop_527                 1 1 65 615 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_51_ncnnreshape0 1 1 615 616 0=0 1=0
Crop                     crop_528                 1 1 80 617 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_52_ncnnreshape0 1 1 617 618 0=0 1=0
Crop                     crop_529                 1 1 95 619 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_53_ncnnreshape0 1 1 619 620 0=0 1=0
InnerProduct             linear_168               1 1 606 621 0=768 1=1 2=196608
Split                    splitncnn_101            1 2 621 622 623
BinaryOp                 sub_86                   1 1 622 624 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 624 625
BinaryOp                 mul_87                   2 1 623 625 626 0=2
InnerProduct             linear_169               1 1 626 627 0=256 1=1 2=196608
BinaryOp                 add_88                   2 1 603 627 628 0=0
Split                    splitncnn_102            1 2 628 629 630
PoolingModuleNoProj      pooling_modul_no_proj_655 3 3 630 608 610 631 632 633
InnerProduct             linear_170               1 1 631 634 0=256 1=0 2=65536
BinaryOp                 add_89                   2 1 629 634 635 0=0
Split                    splitncnn_103            1 2 635 636 637
InnerProduct             linear_171               1 1 637 638 0=496 1=1 2=126976
Slice                    tensor_split_3           1 4 638 639 640 641 642 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 614 641 643 0=0
Split                    splitncnn_104            1 2 643 644 645
Reshape                  reshape_278              1 1 644 646 0=24 1=4 2=40
Reshape                  reshape_279              1 1 639 647 0=48 1=4 2=8
Reshape                  reshape_280              1 1 642 648 0=4 1=4 2=8
Concat                   cat_16                   2 1 612 640 649 0=0
Split                    splitncnn_105            1 2 649 650 651
Reshape                  reshape_281              1 1 650 652 0=48 1=4 2=40
InnerProduct             linear_172               1 1 121 653 0=16 1=0 2=4096
Reshape                  reshape_282              1 1 653 654 0=4 1=4 2=47
Permute                  permute_600              1 1 654 655 0=3
Permute                  permute_598              1 1 648 656 0=2
MatMul                   matmul_424               2 1 656 655 657
Permute                  permute_599              1 1 652 658 0=3
Permute                  permute_597              1 1 647 659 0=2
MatMul                   matmul_425               2 1 659 658 660
TensorAsStrided          tensor_as_strided_665    1 1 657 661 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_90                   2 1 660 661 662 0=0
Reshape                  view_391                 1 1 662 663 0=40 1=8 2=4
Softmax                  softmax_77               1 1 663 664 0=-1 1=1
Split                    splitncnn_106            1 2 664 665 666
Permute                  permute_596              1 1 646 667 0=2
MatMul                   bmm_404                  2 1 666 667 668
Permute                  permute_601              1 1 668 669 0=2
Reshape                  reshape_283              1 1 669 670 0=96 1=8
InnerProduct             linear_173               1 1 670 671 0=256 1=1 2=24576
BinaryOp                 add_91                   2 1 636 671 672 0=0
Split                    splitncnn_107            1 2 672 673 674
Permute                  permute_462              1 1 674 675 0=1
Convolution1D            conv1d_100               1 1 675 676 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_6                    1 1 676 677 0=0
Concat                   cat_17                   2 1 618 677 678 0=1
Split                    splitncnn_108            1 2 678 679 680
ConvolutionDepthWise1D   convdw1d_687             1 1 680 681 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_109            1 2 681 682 683
BinaryOp                 sub_92                   1 1 682 684 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 684 685
BinaryOp                 mul_93                   2 1 683 685 686 0=2
Convolution1D            conv1d_101               1 1 686 687 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_463              1 1 687 688 0=1
BinaryOp                 add_94                   2 1 673 688 689 0=0
Split                    splitncnn_110            1 2 689 690 691
InnerProduct             linear_174               1 1 691 692 0=768 1=1 2=196608
Split                    splitncnn_111            1 2 692 693 694
BinaryOp                 sub_95                   1 1 693 695 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 695 696
BinaryOp                 mul_96                   2 1 694 696 697 0=2
InnerProduct             linear_175               1 1 697 698 0=256 1=1 2=196608
BinaryOp                 add_97                   2 1 690 698 699 0=0
Split                    splitncnn_112            1 2 699 700 701
InnerProduct             linear_176               1 1 701 702 0=96 1=0 2=24576
Concat                   cat_18                   2 1 616 702 703 0=0
Split                    splitncnn_113            1 2 703 704 705
Reshape                  reshape_284              1 1 704 706 0=24 1=4 2=40
Permute                  permute_602              1 1 706 707 0=2
MatMul                   bmm_405                  2 1 665 707 708
Permute                  permute_603              1 1 708 709 0=2
Reshape                  reshape_285              1 1 709 710 0=96 1=8
InnerProduct             linear_177               1 1 710 711 0=256 1=1 2=24576
BinaryOp                 add_98                   2 1 700 711 712 0=0
Split                    splitncnn_114            1 2 712 713 714
Permute                  permute_464              1 1 714 715 0=1
Convolution1D            conv1d_102               1 1 715 716 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_7                    1 1 716 717 0=0
Concat                   cat_19                   2 1 620 717 718 0=1
Split                    splitncnn_115            1 2 718 719 720
ConvolutionDepthWise1D   convdw1d_688             1 1 720 721 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_116            1 2 721 722 723
BinaryOp                 sub_99                   1 1 722 724 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 724 725
BinaryOp                 mul_100                  2 1 723 725 726 0=2
Convolution1D            conv1d_103               1 1 726 727 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_465              1 1 727 728 0=1
BinaryOp                 add_101                  2 1 713 728 729 0=0
Split                    splitncnn_117            1 2 729 730 731
InnerProduct             linear_178               1 1 731 732 0=768 1=1 2=196608
Split                    splitncnn_118            1 2 732 733 734
BinaryOp                 sub_102                  1 1 733 735 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 735 736
BinaryOp                 mul_103                  2 1 734 736 737 0=2
InnerProduct             linear_179               1 1 737 738 0=256 1=1 2=196608
BinaryOp                 add_104                  2 1 730 738 739 0=0
Split                    splitncnn_119            1 3 739 740 741 742
BinaryOp                 mul_105                  2 1 740 741 743 0=2
Reduction                mean_441                 1 1 743 744 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_106                  1 1 744 745 0=0 1=1 2=1.053647e+01
BinaryOp                 pow_107                  1 1 745 746 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_108                  2 1 742 746 747 0=2
BinaryOp                 sub_109                  2 1 747 604 748 0=1
BinaryOp                 mul_110                  2 1 748 118 749 0=2
BinaryOp                 add_111                  2 1 605 749 750 0=0
MemoryData               encoders.1.out_combiner  0 1 751 0=1
Split                    splitncnn_120            1 2 751 752 753
BinaryOp                 sub_112                  1 1 752 754 0=7 1=1 2=1.000000e+00
SimpleUpsample           simple_upsample_677      1 1 750 755 0=2 1=256 2=512
BinaryOp                 mul_113                  2 1 755 754 756 0=2
BinaryOp                 mul_114                  2 1 444 753 757 0=2
BinaryOp                 add_115                  2 1 757 756 758 0=0
Split                    splitncnn_121            1 3 758 759 760 761
MemoryData               encoders.2.downsample    0 1 762 0=256 1=1 2=1
Reshape                  reshape_286              1 1 761 763 0=256 1=4 2=4
Split                    splitncnn_122            1 2 763 764 765
BinaryOp                 mul_116                  2 1 764 762 766 0=2
Reduction                sum_493                  1 1 766 767 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_78               1 1 767 768 0=1 1=1
BinaryOp                 mul_117                  2 1 765 768 769 0=2
Reduction                sum_494                  1 1 769 770 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_530                 1 1 9 771 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.2.encoder.state_select_list.0_ncnnreshape0 1 1 771 772 0=0 1=0
Crop                     crop_531                 1 1 24 773 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_62_ncnnreshape0 1 1 773 774 0=0 1=0
Crop                     crop_532                 1 1 39 775 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_63_ncnnreshape0 1 1 775 776 0=0 1=0
Crop                     crop_533                 1 1 54 777 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_64_ncnnreshape0 1 1 777 778 0=0 1=0
Crop                     crop_534                 1 1 69 779 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_65_ncnnreshape0 1 1 779 780 0=0 1=0
Crop                     crop_535                 1 1 84 781 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_66_ncnnreshape0 1 1 781 782 0=0 1=0
Crop                     crop_536                 1 1 99 783 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_67_ncnnreshape0 1 1 783 784 0=0 1=0
Split                    splitncnn_123            1 4 770 785 786 787 788
InnerProduct             linear_180               1 1 788 789 0=768 1=1 2=196608
Split                    splitncnn_124            1 2 789 790 791
BinaryOp                 sub_118                  1 1 790 792 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 792 793
BinaryOp                 mul_119                  2 1 791 793 794 0=2
InnerProduct             linear_181               1 1 794 795 0=256 1=1 2=196608
BinaryOp                 add_120                  2 1 785 795 796 0=0
Split                    splitncnn_125            1 2 796 797 798
PoolingModuleNoProj      pooling_modul_no_proj_656 3 3 798 772 774 799 800 801
InnerProduct             linear_182               1 1 799 802 0=256 1=0 2=65536
BinaryOp                 add_121                  2 1 797 802 803 0=0
Split                    splitncnn_126            1 2 803 804 805
InnerProduct             linear_183               1 1 805 806 0=496 1=1 2=126976
Slice                    tensor_split_4           1 4 806 807 808 809 810 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 778 809 811 0=0
Split                    splitncnn_127            1 2 811 812 813
Reshape                  reshape_287              1 1 812 814 0=24 1=4 2=20
Reshape                  reshape_288              1 1 807 815 0=48 1=4 2=4
Reshape                  reshape_289              1 1 810 816 0=4 1=4 2=4
Concat                   cat_21                   2 1 776 808 817 0=0
Split                    splitncnn_128            1 2 817 818 819
Reshape                  reshape_290              1 1 818 820 0=48 1=4 2=20
InnerProduct             linear_184               1 1 116 821 0=16 1=0 2=4096
Reshape                  reshape_291              1 1 821 822 0=4 1=4 2=23
Permute                  permute_608              1 1 822 823 0=3
Permute                  permute_606              1 1 816 824 0=2
MatMul                   matmul_426               2 1 824 823 825
Permute                  permute_607              1 1 820 826 0=3
Permute                  permute_605              1 1 815 827 0=2
MatMul                   matmul_427               2 1 827 826 828
TensorAsStrided          tensor_as_strided_666    1 1 825 829 -23300=3,4,4,20 -23301=3,92,22,1 2=3
BinaryOp                 add_122                  2 1 828 829 830 0=0
Reshape                  view_392                 1 1 830 831 0=20 1=4 2=4
Softmax                  softmax_79               1 1 831 832 0=-1 1=1
Split                    splitncnn_129            1 2 832 833 834
Permute                  permute_604              1 1 814 835 0=2
MatMul                   bmm_406                  2 1 834 835 836
Permute                  permute_609              1 1 836 837 0=2
Reshape                  reshape_292              1 1 837 838 0=96 1=4
InnerProduct             linear_185               1 1 838 839 0=256 1=1 2=24576
BinaryOp                 add_123                  2 1 804 839 840 0=0
Split                    splitncnn_130            1 2 840 841 842
Permute                  permute_466              1 1 842 843 0=1
Convolution1D            conv1d_104               1 1 843 844 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_8                    1 1 844 845 0=0
Concat                   cat_22                   2 1 782 845 846 0=1
Split                    splitncnn_131            1 2 846 847 848
ConvolutionDepthWise1D   convdw1d_689             1 1 848 849 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
